{
  "en": {
    "language": "English",
    "title": "Welcome to the React Language Switcher Template",
    "description": "The purpose of this template it to provide developers with an easy way to add languages throughout their application without the dependency of an external library.",
    "howItWorks": "How It Works",
    "howP1": "Step 1: Add your translation to the languages.json file.",
    "howP2": "Step 2: There is no step 2. You're done.",
    "easy": "That was easy!",
    "implement": "Simply implement this pattern in your app once and let the pattern do it's magic.",
    "goodbye": "That's all there is to it! Have yourself a great day."
  },
  "fr": {
    "language": "Français",
    "title": "Bienvenue sur le modèle de sélecteur de langue de React",
    "description": "Le but de ce modèle est de fournir aux développeurs un moyen facile d'ajouter des langues à travers leur application sans la dépendance d'une bibliothèque externe.",
    "howItWorks": "Comment ça marche",
    "howP1": "Étape 1 : Ajoutez votre traduction au fichier languages.json.",
    "howP2": "Étape 2 : Il n'y a pas d'étape 2. Vous avez terminé.",
    "easy": "C'était facil!",
    "implement": "Implémentez simplement ce modèle dans votre application une fois et laissez le modèle faire sa magie.",
    "goodbye": "C'est tout ce qu'il y a à faire! Passez une excellente journée."
  },
  "es": {
    "language": "Español",
    "title": "Bienvenido a la plantilla React Language Switcher",
    "description": "El propósito de esta plantilla es proporcionar a los desarrolladores una forma sencilla de añadir idiomas en toda su aplicación sin la dependencia de una biblioteca externa.",
    "howItWorks": "Cómo Funciona",
    "howP1": "Paso 1: Añade tu traducción al archivo languages.json.",
    "howP2": "Paso 2: No hay paso 2. Listo.",
    "easy": "Ha sido fácil!",
    "implement": "Simplemente implementa este patrón en tu app una vez y deja que el patrón haga su magia.",
    "goodbye": "Eso es todo lo que hay que hacer! Que tenga un buen día."
  },
  "de": {
    "language": "Deutsch",
    "title": "Willkommen bei der React Language Switcher Vorlage",
    "description": "Der Zweck dieses Templates ist es, Entwicklern eine einfache Möglichkeit zu bieten, Sprachen in ihrer Anwendung hinzuzufügen, ohne von einer externen Bibliothek abhängig zu sein",
    "howItWorks": "Wie es funktioniert.",
    "howP1": "Schritt 1: Fügen Sie Ihre Übersetzung in die Datei languages.json ein.",
    "howP2": "Schritt 2: Es gibt keinen Schritt 2. Sie sind fertig.",
    "easy": "Das war einfach!",
    "implement": "Implementieren Sie dieses Muster einfach einmal in Ihrer App und lassen Sie das Muster seine Wirkung entfalten.",
    "goodbye": "Mehr gibt es nicht zu sagen! Ich wünsche Ihnen einen schönen Tag."
  }
}
